//=============================================================================
//
// PRESS ENTER 処理 [PressEnter.cpp]
// Author : Kodama Yuto
//
//=============================================================================
#include "PressEnter.h"

//==================================================================
// マクロ定義
//==================================================================
#define DRAW_INTERVAL (30)
#define DRAW_INTERVAL_FAST (3)

//==================================================================
// コンストラクタ&デストラクタ
//==================================================================
CPressEnter::CPressEnter(CScene::PRIORITY pri) : CScene2D(pri)
{

}
CPressEnter::~CPressEnter()
{

}

//==================================================================
// 設定処理
//==================================================================
void CPressEnter::Set(D3DXVECTOR3 pos)
{
	CScene2D::Set(pos, "PRESS_ENTER");
	CScene2D::SetPosition(pos,D3DXVECTOR2(200.0f,50.0f));
}

//==================================================================
// 初期化処理
//==================================================================
HRESULT CPressEnter::Init(void)
{
	m_nCount = 0;
	m_bDraw = false;
	m_bEnter = false;
	CScene2D::Init();
	return S_OK;
}

//==================================================================
// 終了処理
//==================================================================
void CPressEnter::Uninit(void)
{
	CScene2D::Uninit();
}

//==================================================================
// 更新処理
//==================================================================
void CPressEnter::Update(void)
{
	if (m_bEnter == false)
	{
		if (m_nCount % DRAW_INTERVAL == 0)
		{
			m_bDraw ^= 1;
		}
	}
	else
	{
		if (m_nCount % DRAW_INTERVAL_FAST == 0)
		{
			m_bDraw ^= 1;
		}
	}

	m_nCount++;
	CScene2D::Update();
}

//==================================================================
// 描画処理
//==================================================================
void CPressEnter::Draw(void)
{
	if (m_bDraw == true)
	{
		CScene2D::Draw();
	}
}

