//=============================================================================
//
// タイトルロゴ処理 [TitleObject.cpp]
// Author : Kodama Yuto
//
//=============================================================================
#include "TitleObject.h"

//==================================================================
// マクロ定義
//==================================================================
#define LEAP_TIME (300) //移動時間

//==================================================================
// コンストラクタ&デストラクタ
//==================================================================
CTitleLogo::CTitleLogo(CScene::PRIORITY pri) : CScene2D(pri)
{

}
CTitleLogo::~CTitleLogo()
{

}

//==================================================================
// 設定処理
//==================================================================
void CTitleLogo::Set(D3DXVECTOR3 StartPos, D3DXVECTOR3 GoalPos,D3DXVECTOR2 Size)
{
	m_StartPos = StartPos;
	m_GoalPos = GoalPos;

	CScene2D::Set(m_StartPos,"TITLE_LOGO");
	CScene2D::SetPosition(m_StartPos,Size);

	m_nCount = 0;
}

//==================================================================
// 初期化処理
//==================================================================
HRESULT CTitleLogo::Init(void)
{
	CScene2D::Init();
	return S_OK;
}

//==================================================================
// 終了処理
//==================================================================
void CTitleLogo::Uninit(void)
{
	CScene2D::Uninit();
}

//==================================================================
// 更新処理
//==================================================================
void CTitleLogo::Update(void)
{
	D3DXVECTOR3 LeapPos;

	if (m_nCount <= LEAP_TIME)
	{
		D3DXVec3Lerp(&LeapPos,&m_StartPos,&m_GoalPos,((float)m_nCount) / LEAP_TIME);
		SetPosition(LeapPos);
	}
	else
	{
		SetPosition(m_GoalPos);
	}


	m_nCount++;
	CScene2D::Update();
}

//==================================================================
// 描画処理
//==================================================================
void CTitleLogo::Draw(void)
{
	CScene2D::Draw();
}

//==================================================================
// タイトル遷移処理
//==================================================================
void  CTitleLogo::TitleFade(void)
{
	SetPosition(m_GoalPos);
	m_nCount = 300;
}


