//=============================================================================
//
// エフェクトの処理 [effect.h]
// Author : Hodaka Niwa
//
//=============================================================================
#ifndef _EFFECT_H_
#define _EFFECT_H_

#include "main.h"

//*****************************************************************************
// エフェクトの構造体
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3   pos;              // 位置(中心)
	D3DXVECTOR3   rot;              // 向き
	D3DXMATRIX    mtxWorld;         // ワールドマトリックス
	D3DXCOLOR     col;              // 色
	float         fRadius;          // 半径
	int           nLife;            // 寿命
	int           nIdxShadow;       // 使用している影の番号
	bool          bUse;             // 使用しているかどうか
}Effect;

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define  MAX_EFFECT   (256)        // エフェクトの総数

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitEffect(void);
void UninitEffect(void);
void UpdateEffect(void);
void DrawEffect(void);
void SetEffect(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXCOLOR col, float radius, int life);
#endif
