//=============================================================================
//
// 草の処理 [leaf.h]
// Author :　Jukiya Hayakawa
//
//=============================================================================
#ifndef _LEAF_H_
#define _LEAF_H_

#include "main.h"

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	// 位置
	D3DXVECTOR3 move;	// 移動
	D3DXCOLOR col;		// 色
	bool bUse;
} Leaf;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitLeaf(void);
void UninitLeaf(void);
void UpdateLeaf(void);
void DrawLeaf(void);
void SetLeaf(D3DXVECTOR3 pos, D3DXVECTOR3 move);

#endif
