//=============================================================================
// 
// ミニマップの中のプレイヤー処理 [mapPlayer.h]
// Author : 長山拓実
//
//=============================================================================
#ifndef _MAPPLAYER_H_
#define _MAPPLAYER_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitMapPlayer(void);
void UninitMapPlayer(void);
void UpdateMapPlayer(void);
void DrawMapPlayer(void);

#endif