//=============================================================================
//
// ランクの処理 [rank.h]
// Author :　Jukiya Hayakawa
//
//=============================================================================
#ifndef _RANK_H_
#define _RANK_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef enum
{// 敵の状態
	RANK_1 = 0,	// １位
	RANK_2,		// ２位
	RANK_MAX,	
} PLAYER_RANK;

typedef struct
{
	D3DXVECTOR3 pos;	// 位置
	PLAYER_RANK rank;	
	bool bUse;
} RANK;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitRank(void);
void UninitRank(void);
void UpdateRank(void);
void DrawRank(void);
void SetRank(PLAYER_RANK rank);
RANK *GetRank(void);
void SwitchRank(PLAYER_RANK rank);
#endif