//=============================================================================
//
// 結果画面処理 [result.h]
// Author : Niwa Hodaka, Miyu Takahashi
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define RESULT_MODELC	(6)		// モデルの最大数(ゲームクリア)
#define RESULT_MODELO	(1)		// モデルの最大数(ゲームオーバー)

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	LPD3DXMESH pMesh;			// メッシュ情報へのポインタ(頂点情報)
	LPD3DXBUFFER pBuffMat;		// マテリアル情報へのポインタ(色)
	DWORD nNumMat;				// マテリアル情報の数
	D3DXMATRIX mtxWorld;		// ワールドマトリックス
	D3DXVECTOR3 pos;			// 位置
	D3DXVECTOR3 rot;			// 向き
	int nIdxModelParent;		// 親モデルのインデックス
}ResultModel;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif
