//=============================================================================
//
// タイム処理 [time.h]
// Author : Kodama Yuto
//
//=============================================================================
#ifndef _TIME_H_
#define _TIME_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_TIME		"data/TEXTURE/number001.png"	// 読み込むテクスチャファイル名
#define	TEXTURE_TIME_1		"data/TEXTURE/Time.png"	// 読み込むテクスチャファイル名

#define MAX_TIME_DIGIT (3)									//桁数
#define TIME_SIZE     (20.0f)								//タイムの大きさ

#define TIME_POS_X (600)									//タイムのX軸
#define TIME_POS_Y (75)										//タイムのY軸

#define TIME_INTERVAL (45)									//タイムの間隔

//=============================================================================
// 構造体の定義
//=============================================================================
typedef struct
{
	D3DXCOLOR col;		//色
	bool bScoreFlag;	//スコア加算のフラグ
	int nTime;			//制限時間
}Time;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTime(void);
void UninitTime(void);
void UpdateTime(void);
void DrawTime(void);
int GetTime(void);
#endif
