//=============================================================================
//
// 背景処理 [bullet.h]
// Author : Kodama Yuto
//
//=============================================================================
#ifndef _BG_H_	//二重インクルード防止のマクロ定義
#define _BG_H_

//=============================================================================
//								マクロ定義
//=============================================================================
#define BG_TEXTURE_100 "data/TEXTURE/bg100.png"	  //背景に貼るテクスチャの名前
#define BG_TEXTURE_101 "data/TEXTURE/bg101.png"	  //背景に貼るテクスチャの名前
#define BG_TEXTURE_102 "data/TEXTURE/bg102.png"	  //背景に貼るテクスチャの名前
#define BG_POS_X (SCREEN_WIDTH / 2)					  //X座標		
#define BG_POS_Y (SCREEN_HEIGHT / 2)					  //Y座標					


//-----------------------------------------------------------------------------
//							プロトタイプ宣言
//-----------------------------------------------------------------------------
void InitBG(void);
void UninitBG(void);
void UpdateBG(void);
void DrawBG(void);

#endif // !_BG_H_

